Repository: arkadeleon/ragnarok-offline
Catalog: Packages/swift-ro/Sources/ROConstants/Resources/WeaponType.xcstrings
Source language: en
Languages: de, es, fr, id, it, ja, ko, pt_br, ru, th, tr, zh_hans, zh_hant

source: Book
de: Buch
es: Libro
fr: Livre
id: Buku
it: Libro
ja: 書
ko: 책
pt_br: Livro
ru: Книга
th: หนังสือ
tr: Kitap
zh_hans: 书
zh_hant: 書

source: Bow
de: Bogen
es: Arco
fr: Arc
id: Busur
it: Arco
ja: 弓
ko: 활
pt_br: Arco
ru: Лук
th: คันธนู
tr: Yay
zh_hans: 弓
zh_hant: 弓

source: Dagger
de: Dolch
es: Daga
fr: Dague
id: Belati
it: Pugnale
ja: 短剣
ko: 단검
pt_br: Adaga
ru: Кинжал
th: กริช
tr: Hançer
zh_hans: 短剑
zh_hant: 短劍

source: Fist
de: Faust
es: Puño
fr: Poing
id: Tinju
it: Pugno
ja: 拳
ko: 주먹
pt_br: Punho
ru: Кулак
th: กำปั้น
tr: Yumruk
zh_hans: 拳头
zh_hant: 拳頭

source: Gatling
de: Gatling-Gewehr
es: Ametralladora Gatling
fr: Mitrailleuse Gatling
id: Senapan Gatling
it: Mitragliatrice Gatling
ja: ガトリング機関銃
ko: 개틀링 기관총
pt_br: Metralhadora Gatling
ru: Пулемёт Гатлинга
th: ปืนกลแกตลิง
tr: Gatling Silahı
zh_hans: 格林机关枪
zh_hant: 格林機關槍

source: Grenade
de: Granatwerfer
es: Lanzagranadas
fr: Lance-grenades
id: Peluncur Granat
it: Lanciagranate
ja: 榴弾銃
ko: 유탄발사기
pt_br: Lança-granadas
ru: Гранатомёт
th: ปืนยิงระเบิด
tr: Bomba Atar
zh_hans: 榴弹枪
zh_hant: 榴彈槍

source: Huuma
de: Huuma-Shuriken
es: Huuma Shuriken
fr: Shuriken Huuma
id: Huuma Shuriken
it: Huuma Shuriken
ja: 風魔手裏剣
ko: 후우마 수리검
pt_br: Huuma Shuriken
ru: Сюрикен Хуума
th: ฮูมะ ชูริเคน
tr: Huuma Shuriken
zh_hans: 风魔
zh_hant: 風魔

source: Knuckle
de: Schlagring
es: Nudillos
fr: Coup-de-poing
id: Buku Jari
it: Tirapugni
ja: ナックル
ko: 너클
pt_br: Soco Inglês
ru: Кастет
th: นัคเคิล
tr: Muşta
zh_hans: 拳套
zh_hant: 拳套

source: Mace
de: Streitkolben
es: Maza
fr: Masse
id: Gada
it: Mazza
ja: 単手鈍器
ko: 한손 둔기
pt_br: Maça
ru: Булава
th: คทา
tr: Topuz
zh_hans: 单手钝器
zh_hant: 單手鈍器

source: Musical
de: Musikinstrument
es: Instrumento Musical
fr: Instrument de Musique
id: Alat Musik
it: Strumento Musicale
ja: 楽器
ko: 악기
pt_br: Instrumento Musical
ru: Музыкальный инструмент
th: เครื่องดนตรี
tr: Müzik Aleti
zh_hans: 乐器
zh_hant: 樂器

source: One-Handed Axe
de: Einhändige Axt
es: Hacha de una mano
fr: Hache à une main
id: Kapak Satu Tangan
it: Ascia a una mano
ja: 片手斧
ko: 한손 도끼
pt_br: Machado de uma mão
ru: Одноручный топор
th: ขวานมือเดียว
tr: Tek El Balta
zh_hans: 单手斧
zh_hant: 單手斧

source: One-Handed Spear
de: Einhändiger Speer
es: Lanza de una mano
fr: Lance à une main
id: Tombak Satu Tangan
it: Lancia a una mano
ja: 片手槍
ko: 한손 창
pt_br: Lança de uma mão
ru: Одноручное копьё
th: หอกมือเดียว
tr: Tek El Mızrak
zh_hans: 单手矛/枪/戟
zh_hant: 單手矛/槍/戟

source: One-Handed Sword
de: Einhändiges Schwert
es: Espada de una mano
fr: Épée à une main
id: Pedang Satu Tangan
it: Spada a una mano
ja: 片手剣
ko: 한손 검
pt_br: Espada de uma mão
ru: Одноручный меч
th: ดาบมือเดียว
tr: Tek El Kılıç
zh_hans: 单手剑
zh_hant: 單手劍

source: Rifle
de: Gewehr
fr: Fusil
id: Senapan
it: Fucile
ja: ライフル
ko: 라이플
ru: Винтовка
th: ปืนไรเฟิล
tr: Tüfek
zh_hans: 来复枪
zh_hant: 來復槍

source: Shield
de: Schild
es: Escudo
fr: Bouclier
id: Perisai
it: Scudo
ja: 盾
ko: 방패
pt_br: Escudo
ru: Щит
th: โล่
tr: Kalkan
zh_hans: 盾牌
zh_hant: 盾牌

source: Shotgun
de: Schrotflinte
es: Escopeta
fr: Fusil à pompe
id: Senapan Pompa
it: Fucile a pompa
ja: ショットガン
ko: 샷건
pt_br: Espingarda
ru: Дробовик
th: ปืนลูกซอง
tr: Av Tüfeği
zh_hans: 散弹枪
zh_hant: 散彈槍

source: Staff
de: Stab
es: Bastón
fr: Bâton
id: Tongkat
it: Bastone
ja: 片手杖
ko: 한손 지팡이
pt_br: Cajado
ru: Жезл
th: ไม้เท้า
tr: Asa
zh_hans: 单手杖
zh_hant: 單手杖

source: Two-Handed Axe
de: Zweihändige Axt
es: Hacha de dos manos
fr: Hache à deux mains
id: Kapak Dua Tangan
it: Ascia a due mani
ja: 両手斧
ko: 양손 도끼
pt_br: Machado de duas mãos
ru: Двуручный топор
th: ขวานสองมือ
tr: İki El Balta
zh_hans: 双手斧
zh_hant: 雙手斧

source: Two-Handed Mace
de: Zweihändiger Streitkolben
es: Maza de dos manos
fr: Masse à deux mains
id: Gada Dua Tangan
it: Mazza a due mani
ja: 両手鈍器
ko: 양손 둔기
pt_br: Maça de duas mãos
ru: Двуручная булава
th: คทาสองมือ
tr: İki El Topuz
zh_hans: 双手钝器
zh_hant: 雙手鈍器

source: Two-Handed Spear
de: Zweihändiger Speer
es: Lanza de dos manos
fr: Lance à deux mains
id: Tombak Dua Tangan
it: Lancia a due mani
ja: 両手槍
ko: 양손 창
pt_br: Lança de duas mãos
ru: Двуручное копьё
th: หอกสองมือ
tr: İki El Mızrak
zh_hans: 双手矛/枪/戟
zh_hant: 雙手矛/槍/戟

source: Two-Handed Staff
de: Zweihändiger Stab
es: Bastón de dos manos
fr: Bâton à deux mains
id: Tongkat Dua Tangan
it: Bastone a due mani
ja: 両手杖
ko: 양손 지팡이
pt_br: Cajado de duas mãos
ru: Двуручный жезл
th: ไม้เท้าสองมือ
tr: İki El Asa
zh_hans: 双手杖
zh_hant: 雙手杖

source: Two-Handed Sword
de: Zweihändiges Schwert
es: Espada de dos manos
fr: Épée à deux mains
id: Pedang Dua Tangan
it: Spada a due mani
ja: 両手剣
ko: 양손 검
pt_br: Espada de duas mãos
ru: Двуручный меч
th: ดาบสองมือ
tr: İki El Kılıç
zh_hans: 双手剑
zh_hant: 雙手劍

source: Whip
de: Peitsche
es: Látigo
fr: Fouet
id: Cambuk
it: Frusta
ja: 鞭
ko: 채찍
pt_br: Chicote
ru: Кнут
th: แส้
tr: Kırbaç
zh_hans: 鞭子
zh_hant: 鞭子

source: Revolver
es: Revólver
ja: リボルバー
ko: 리볼버
pt_br: Revólver
ru: Револьвер
th: ปืนลูกโม่
zh_hans: 左轮手枪
zh_hant: 左輪手槍

source: Katar
ja: カタール
ko: 카타르
ru: Катар
th: กาตาร์
zh_hans: 拳刃
zh_hant: 拳刃
